lui $1, 0x0001
addiu $2, $0, 2
sw $1, 0x7000
lw $3, 0x7000               # load 相关 (3,4)
beq $1, $3 next
next:
    addi $4, $0, 0x0003 		
    andi $5, $4, 0xff00     # 相邻数据相关 (7,8)
    ori $6, $4, 0xff00      # 隔一条数据相关 (7,9)
    xori $7, $4, 0xff00     # 隔两条数据相关 (7,10)
    add $8, $6, $7          # 相邻数据相关 + 隔一条数据相关 (10,11)
    and $9, $8, $7          # 相邻数据相关 + 隔一条数据相关
    or $10, $8, $9          # 相邻数据相关 + 隔一条数据相关 
    xor $11, $8, $9         # 隔一条数据相关 + 隔两条数据相关
    nor $12, $8, $9         # 隔两条数据相关
    j exit 
exit:
    addi $13, $0, 0x4c 
    jr $13
    lui $14, 0x5678         # 控制相关：不应该被执行
    lui $14, 0x1000         # 控制相关：不应该被执行
    lui $14, 0x1234         # 指令地址是 0x4c 



    
